export default function TermsContent() {
  return (
    <div className="space-y-4 text-gray-300 font-serif">
      <h4 className="text-lg text-white font-semibold">第1条 [総則]</h4>
      <p>BAR　忍（以下、当店）は、従来の会員制Barに比べてさらに高品質な&quot;上質のもてなし&quot;と&quot;上質な空間&quot;を提供する完全会員制サービスです。限られた会員のみが集まる完全会員制度により、上質な空間を通して心の安心感や信頼感をご提供いたします。</p>
      <p>本規約は当店の運営全般に関する規定です。入会時には、会員は本規約を承諾したものとみなされます。また、本規約の一部が変更・修正される場合や、一時的な諸規則が適用される場合があることを予めご了承ください。</p>

      <h4 className="text-lg text-white font-semibold">第2条 [入会申込資格]</h4>
      <p>当店の趣旨に賛同し、年齢が満20歳以上で以下の資格を有する方は、当店所定の方法で入会を申し込むことができます。</p>
      <p>・社会的および経済的に安定している方</p>
      <p>・会員からの推薦またはご紹介のある方</p>

      <h4 className="text-lg text-white font-semibold">第3条 [入会審査]</h4>
      <p>入会申し込みがあった場合、当店の入会審査委員会が所定の審査を行います。審査結果は速やかにお申し込み者本人に通知されます。審査は、当店が定める基準に基づいて行われます。なお、審査結果に関する異議申し立ては受け付けられません。</p>

      <h4 className="text-lg text-white font-semibold">第4条 [当店のご利用について]</h4>
      <p>当店をご利用いただく際は、公式LINEを通して事前予約をお願いいたします。</p>

      <h4 className="text-lg text-white font-semibold">第5条 [会員資格の失効]</h4>
      <p>会員の中には、当店の会員規約に違反する行為、当店に損害を与える行為、他の会員の名誉を傷つける言動などが見られる場合があります。当該会員は、当店からの注意や警告にもかかわらず、改善が見込めない場合には、会員資格を失効させられることがあります。また、入会申込に虚偽の内容があった場合も会員資格は失効させられます。連絡先や所在地などの登録情報に変更があった場合は、迅速にご連絡ください。連絡がない場合、会員資格が失効する場合があります。なお、これらに限らず、当店が資格失効と判断した場合には同様の処置が取られます。</p>

      <h4 className="text-lg text-white font-semibold">第6条 [退会]</h4>
      <p>会員はいつでも退会の申し出ができます。</p>

      <h4 className="text-lg text-white font-semibold">第7条 [紹介および推薦]</h4>
      <p>会員は、ご交友の中から当店にふさわしいと思われる方を新たな会員としてご紹介または推薦することができます。当店は完全招待制です。</p>

      <h4 className="text-lg text-white font-semibold">第8条 [特記事項]</h4>
      <p>会員が暴力団関係者または反社会的人物であることが発覚した場合（関わりがある場合を含む）、当店は当該会員の会員資格を剥奪することができます。</p>

      <h4 className="text-lg text-white font-semibold">第9条 [損害賠償の請求]</h4>
      <p>会員が本規約に違反した行為や不正行為、違法行為によって当店に損害を与えた場合、当店は会員に対して損害賠償を請求することができます（弁護士費用を含む）。</p>

      <h4 className="text-lg text-white font-semibold">第10条 [準拠法・合意管轄]</h4>
      <p>本契約は日本法に基づいて解釈されます。本規約に関する紛争が協議によって解決されない場合、東京簡易裁判所または東京地方裁判所を第一審の専属的合意管轄裁判所とします。</p>

      <h4 className="text-lg text-white font-semibold">第11条 [協議]</h4>
      <p>本規約に明記されていない事項や解釈に疑義が生じた場合には、双方が誠意を持って協議し、問題解決に努めます。</p>
    </div>
  );
}
